Public_SOAP_APIs/Countries/imported_from_collection.http

#!/usr/bin/env dothttp

// Returns a list of countries ordered by name.
@name("List of Countries by Name")
POST "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"
"Content-Type": "text/xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <ListOfCountryNamesByName xmlns="http://www.oorsprong.org/websamples.countryinfo">
    </ListOfCountryNamesByName>
  </soap12:Body>
</soap12:Envelope>')


// Returns the name of the captial city for the passed country code.
@name("Captial City for a Country")
POST "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"
"Content-Type": "text/xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CapitalCity>
  </soap:Body>
</soap:Envelope>')


// Returns the currency ISO code and name for the passed country ISO code.
@name("Currency for a Country")
POST "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"
"Content-Type": "text/xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CountryCurrency xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CountryCurrency>
  </soap:Body>
</soap:Envelope>')


// Returns a link to a picture of the country flag
@name("Flag for a Country")
POST "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"
"Content-Type": "text/xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CountryFlag xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CountryFlag>
  </soap:Body>
</soap:Envelope>')


// Returns the internation phone code for the passed ISO country code.
@name("International Phone Code for a Country Copy")
POST "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"
"Content-Type": "text/xml; charset=utf-8"
data('<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CountryIntPhoneCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CountryIntPhoneCode>
  </soap:Body>
</soap:Envelope>')



